## Concat

The concat() function (in the main pandas namespace) does all of the heavy lifting of performing concatenation operations along an axis while performing optional set logic (union or intersection) of the indexes (if any) on the other axes

Clear the existing index and reset it in the result by setting the ignore_index option to True

In [2]:
import pandas as pd

df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
    
})

df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})

frames = [df1, df2]

In [3]:
result = pd.concat(frames, axis=0, sort=True, ignore_index=True)
display(result)

        city  humidity  temperature
0   new york       NaN         21.0
1    chicago       NaN         14.0
2    orlando       NaN         35.0
3  baltimore       NaN         38.0
4    chicago      65.0          NaN
5   new york      68.0          NaN
6  san diego      71.0          NaN

Suppose we wanted to associate specific keys with each of the pieces of the chopped up DataFrame. We can do this using the keys argumen

In [4]:
result = pd.concat(frames, axis=0, keys=['x', 'y'], sort=True)

In [5]:
display(result)

          city  humidity  temperature
x 0   new york       NaN         21.0
  1    chicago       NaN         14.0
  2    orlando       NaN         35.0
  3  baltimore       NaN         38.0
y 0    chicago      65.0          NaN
  1   new york      68.0          NaN
  2  san diego      71.0          NaN

we can now select out each chunk by key

In [8]:
result.loc['y']

        city  humidity  temperature
0    chicago      65.0          NaN
1   new york      68.0          NaN
2  san diego      71.0          NaN

### Concat – axis=1

Combine DataFrame objects horizontally along the x axis by passing in axis=1

In [9]:
result = pd.concat(frames, axis=1, sort=True)

In [10]:
display(result)

        city  temperature       city  humidity
0   new york           21    chicago      65.0
1    chicago           14   new york      68.0
2    orlando           35  san diego      71.0
3  baltimore           38        NaN       NaN

### Append

A useful shortcut to concat() are the append() instance methods on Series and DataFrame. These methods actually predated concat. They concatenate along axis=0, namely the index

In [11]:
result = df1.append(df2, sort=True)
display(result)

        city  humidity  temperature
0   new york       NaN         21.0
1    chicago       NaN         14.0
2    orlando       NaN         35.0
3  baltimore       NaN         38.0
0    chicago      65.0          NaN
1   new york      68.0          NaN
2  san diego      71.0          NaN

In the case of DataFrame, the indexes must be disjoint but the columns do not need to be

In [12]:
result = df1.append(df2, sort=False)
display(result)

        city  temperature  humidity
0   new york         21.0       NaN
1    chicago         14.0       NaN
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
0    chicago          NaN      65.0
1   new york          NaN      68.0
2  san diego          NaN      71.0

append may take multiple objects to concatenate

In [13]:
df3 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "winspeed": [120,80,150],
})

In [14]:
result = df1.append([df2, df3], sort=False, ignore_index=True)
display(result)

        city  temperature  humidity  winspeed
0   new york         21.0       NaN       NaN
1    chicago         14.0       NaN       NaN
2    orlando         35.0       NaN       NaN
3  baltimore         38.0       NaN       NaN
4    chicago          NaN      65.0       NaN
5   new york          NaN      68.0       NaN
6  san diego          NaN      71.0       NaN
7    chicago          NaN       NaN     120.0
8   new york          NaN       NaN      80.0
9  san diego          NaN       NaN     150.0